import csv

#keys: '종목코드'		num
#		'회사명',		str
#		'시장구분',		str -> 삭제
#		'업종',			str -> 삭제
#		'업종명',		str -> 삭제
# 		'결산월',		num -> 삭제
# 		'결산기준일',	str -> 삭제
# 		'보고서종류',	str -> 삭제
# 		'통화',			str -> 삭제
# 		'항목코드',		str -> 삭제
# 		'항목명',		str
# 		'당기',			num
# 		'전기',			num
# 		'전전기',		num
# 		'재무제표종류'	str -> 삭제
# 그리고 기업별로 하나로 묶기.

#필요없는 키들을 삭제했고, 종목코드의 []를 제거하였고, 단위를 통일하기 위해 당기, 전기, 전전기의 ,를 제거하였습니다.
def cleanse_data(row):
	del(row['\ufeff재무제표종류'])
	del(row['시장구분'])
	del(row['업종'])
	del(row['업종명'])
	del(row['결산월'])
	del(row['결산기준일'])
	del(row['보고서종류'])
	del(row['통화'])
	del(row['항목코드'])
	row['종목코드'] = row['종목코드'].replace('[', '').replace(']', '')
	row['당기'] = row['당기'].replace(',', '')
	row['전기'] = row['전기'].replace(',', '')
	row['전전기'] = row['전전기'].replace(',', '')
	num_val_lst = ['종목코드', '당기', '전기', '전전기']
	for item in row:
		if item in num_val_lst and row[item] != '':
			row[item] = int(row[item])
	return row

def get_BS():
	#파일명은 본인 컴퓨터 환경 따라 다를 수 있습니다. 일단 제 컴퓨터 환경에서의 파일명을 걸어놨어요.
	file_name = "C:/Users/savif/OneDrive/바탕 화면/Noodle_Company/daejin/cache/2022/2022_BS.csv"
	f = open(file_name, 'rt', encoding='UTF8')
	reader = csv.DictReader(f)
	cleansed_data = []
	for row in reader:
		cleansed_data.append(cleanse_data(row))
	BS_2022 = {}
	prev_row = cleansed_data[0]
	lst = []
	for row in cleansed_data:
		if prev_row['회사명'] != row['회사명']:
			BS_2022[prev_row['회사명']] = lst
			lst = []
		prev_row = row
		lst.append(row)
	f.close()
	return BS_2022

def get_PL():
	#파일명은 본인 컴퓨터 환경 따라 다를 수 있습니다. 일단 제 컴퓨터 환경에서의 파일명을 걸어놨어요.
	file_name = "C:/Users/savif/OneDrive/바탕 화면/Noodle_Company/daejin/cache/2022/2022_PL.csv"
	f = open(file_name, 'rt', encoding='UTF8')
	reader = csv.DictReader(f)
	cleansed_data = []
	for row in reader:
		cleansed_data.append(cleanse_data(row))
	PL_2022 = {}
	prev_row = cleansed_data[0]
	lst = []
	for row in cleansed_data:
		if prev_row['회사명'] != row['회사명']:
			PL_2022[prev_row['회사명']] = lst
			lst = []
		prev_row = row
		lst.append(row)
	f.close()
	return PL_2022

def merge_BS_PL(BS, PL):
	ret = {}
	for b_key, b_val in BS.items():
		ret[b_key] = b_val
		for p_key, p_val in PL.items():
			if b_key == p_key:
				ret[b_key] = p_val
	return ret

#재무상태표와 손익계산서 데이터를 가져왔습니다. 저장 형식은 딕셔너리 리스트입니다.
BS = get_BS()
PL = get_PL()

#BS와 PL을 합쳤습니다. BS만 있는 기업은 일단 BS만 넣어놨습니다.
MERGED_REPORT = merge_BS_PL(BS, PL)

# MERGED_REPORT = {
# 	기업명 : [2022BS, 2022PL] -> 구분없이 각 줄 딕셔너리로 쭉 들어가있음
# 	...
# }

for item in MERGED_REPORT["경방"]:
	print (item)

#결과는 아래와 같습니다.
{
# 	{'종목코드': 50, '회사명': '경방', '항목명': '매출액', '': '', '당기': 389227582838, '전기': 383357144805, '전전기': 329224740782}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '매출원가', '': '', '당기': 263039745840, '전기': 246771596892, '전전기': 232398638194}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '매출총이익', '': '', '당기': 126187836998, '전기': 136585547913, '전전기': 96826102588}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '판매비와관리비', '': '', '당기': 94292530726, '전기': 82788732713, '전전기': 74972106041}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   급여', '': '', '당기': 3679388497, '전기': 3552749403, '전전기': 3214513768}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   퇴직급여', '': '', '당기': 286243947, '전기': 262357266, '전전기': 228192316}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   복리후생비', '': '', '당기': 533192867, '전기': 491144199, '전전기': 435954223}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   선임과운임', '': '', '당기': 1901032315, '전기': 2546036901, '전전기': 1056677592}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   기술개발비', '': '', '당기': 24191022, '전기': 22381135, '전전기': 28087218}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   여비교통비', '': '', '당기': 329602236, '전기': 320927337, '전전기': 294400606}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   통신비', '': '', '당기': 90204561, '전기': 84255517, '전전기': 85585566}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   차량유지비', '': '', '당기': 63826763, '전기': 44140975, '전전기': 71626035}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   소모품비', '': '', '당기': 284453371, '전기': 138002301, '전전기': 204186253}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   제세공과금', '': '', '당기': 2151071392, '전기': 2083682311, '전전기': 1869434830}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   수도광열비', '': '', '당기': 1785352447, '전기': 1579533221, '전전기': 1684419619}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   감가상각비', '': '', '당기': 10270838738, '전기': 9643076988, '전전기': 9501975052}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   수선비', '': '', '당기': 1014114485, '전기': 767001343, '전전기': 592025153}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   보험료', '': '', '당기': 63357643, '전기': 74715325, '전전기': 45319844}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   광고선전비', '': '', '당기': 918499356, '전기': 894163743, '전전기': 531763004}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   지급수수료', '': '', '당기': 70264895757, '전기': 59463802409, '전전기': 54489854209}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   회의비', '': '', '당기': 16223958, '전기': 15987191, '전전기': 18853182}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   접대비', '': '', '당기': 277413587, '전기': 275375326, '전전기': 269005034}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   도서및교육훈련비', '': '', '당기': 32227275, '전기': 43756189, '전전기': 29972472}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   대손상각비(대손충당금환입)', '': '', '당기': 42062599, '전기': 248358663, '전전기': 3240330}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   임차료', '': '', '당기': 29691447, '전기': 32258438, '전전기': 34242870}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   무형자산상각비', '': '', '당기': 57212446, '전기': 46350018, '전전기': 34339140}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   잡비', '': '', '당기': 177434017, '전기': 158676514, '전전기': 248437725}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '영업이익(손실)', '': '', '당기': 31895306272, '전기': 53796815200, '전전기': 21853996547}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '기타수익', '': '', '당기': 14185777449, '전기': 8709451043, '전전기': 13599767433}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   외환차익', '': '', '당기': 2638373744, '전기': 3358090578, '전전기': 3169927423}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   외화환산이익', '': '', '당기': 10155929108, '전기': 5120137723, '전전기': 3068479011}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   매각예정자산처분이익', '': '', '당기': 1069117, '전기': '', '전전기': 6791197952}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   유형자산처분이익', '': '', '당기': 976091, '전기': 4999000, '전전기': 44285051}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   투자부동산손상차손환입', '': '', '당기': '', '전기': '', '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   잡이익', '': '', '당기': 1389429389, '전기': 226223742, '전전기': 525877996}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '기타비용', '': '', '당기': 12089438718, '전기': 1931956721, '전전기': 12281508815}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   외환차손', '': '', '당기': 3194494363, '전기': 665102121, '전전기': 1643030551}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   외화환산손실', '': '', '당기': 8196183460, '전기': 61922500, '전전기': 3845868679}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   매각예정자산처분손실', '': '', '당기': '', '전기': '', '전전기': 1040972383}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   유형자산처분손실', '': '', '당기': 904490, '전기': 17851533, '전전기': 156031309}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   투자부동산처분손실', '': '', '당기': '', '전기': 21210699, '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   투자부동산손상차손', '': '', '당기': '', '전기': '', '전전기': 3000000000}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   무형자산처분손실', '': '', '당기': '', '전기': '', '전전기': 15400000}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   잡손실', '': '', '당기': 697856405, '전기': 1165869868, '전전기': 2580205893}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '금융수익', '': '', '당기': 5639070791, '전기': 13951336379, '전전기': 11417587431}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   이자수익', '': '', '당기': 93935570, '전기': 58686122, '전전기': 303535023}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   배당금수익', '': '', '당기': 712196731, '전기': 5374464496, '전전기': 679441900}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   당기손익-공정가치금융자산처분이익', '': '', '당기': 2432707396, '전기': 8120575532, '전전기': 8297818432}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   당기손익-공정가치금융자산평가이익', '': '', '당기': 631401928, '전기': 201238961, '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   파생상품거래이익(금융수익)', '': '', '당기': 1656558400, '전기': 85841309, '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   기타금융수익', '': '', '당기': 112270766, '전기': 110529959, '전전기': 2136792076}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '금융비용', '': '', '당기': 26008301701, '전기': 19420247219, '전전기': 13413727750}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   이자비용', '': '', '당기': 7082149528, '전기': 4125303333, '전전기': 6744120784}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   당기손익-공정가치금융자산처분손실', '': '', '당기': 556470407, '전기': 376067825, '전전기': 147790968}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   당기손익-공정가치금융자산평가손실', '': '', '당기': 9303348644, '전기': 8593896648, '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   파생상품거래손실(금융원가)', '': '', '당기': 4131512409, '전기': 8410019, '전전기': 1856680000}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   파생상품평가손실(금융원가)', '': '', '당기': 99057464, '전기': 1640139250, '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   기타금융비용', '': '', '당기': 4835763249, '전기': 4676430144, '전전기': 4665135998}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '관계기업투자손익', '': '', '당기': -11974098438, '전기': -23961248556, '전전기': 1506929659}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   지분법이익', '': '', '당기': '', '전기': 685824518, '전전기': 2246103574}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   지분법손실', '': '', '당기': -12039203324, '전기': -24647073074, '전전기': -739173915}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   관계기업투자처분이익', '': '', '당기': 65104886, '전기': '', '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '법인세비용차감전순이익(손실)', '': '', '당기': 1648315655, '전기': 31144150126, '전전기': 22683044505}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '법인세비용', '': '', '당기': 2766934106, '전기': -8862270189, '전전기': -9657341769}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '당기순이익(손실)', '': '', '당기': 4415249761, '전기': 22281879937, '전전기': 13025702736}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '당기순이익(손실)의 귀속 [abstract]', '': '', '당기': '', '전기': '', '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   지배기업의 소유주에게 귀속되는 당기순이익(손실)', '': '', '당기': 4415025705, '전기': 22281521113, '전전기': 13028369310}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   비지배지분에 귀속되는 당기순이익(손실)', '': '', '당기': 224056, '전기': 358824, '전전기': -2666574}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '주당이익 [abstract]', '': '', '당기': '', '전기': '', '전전기': ''}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   기본주당이익(손실)', '': '', '당기': 177, '전기': 872, '전전기': 499}
# 	{'종목코드': 50, '회사명': '경방', '항목명': '   희석주당이익(손실)', '': '', '당기': 177, '전기': 872, '전전기': 499}
}